{"keras_version": "2.0.4", "backend": "tensorflow", "config": [{"config": {"dilation_rate": [1, 1], "padding": "valid", "activation": "relu", "kernel_constraint": null, "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "trainable": true, "kernel_regularizer": null, "name": "conv2d_1", "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "filters": 32}, "class_name": "Conv2D"}, {"config": {"dilation_rate": [1, 1], "padding": "same", "activation": "relu", "kernel_constraint": null, "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "name": "conv2d_2", "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "filters": 64}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"dilation_rate": [1, 1], "padding": "same", "activation": "relu", "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "name": "conv2d_3", "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "filters": 128}, "class_name": "Conv2D"}, {"config": {"dilation_rate": [1, 1], "padding": "valid", "activation": "relu", "kernel_constraint": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "name": "conv2d_4", "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "filters": 64}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "kernel_constraint": null, "units": 128, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "kernel_constraint": null, "units": 10, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}